{"pages":[],"posts":[{"title":"Jianlei Han 韩剑雷","text":"Welcome to Jianlei Han ‘s website! ContactAssociate Professor in FinanceMacquarie University Business SchoolMacquarie University✉ jianlei.han@mq.edu.au🌐 https://researchers.mq.edu.au/en/persons/jianlei-han https://github.com/jianleihan89🅶 Google Scholar Research InterestFintech, Defi, Corporate Culture, Chinese Capital Market Education-Ph.D. in Finance, University of Queensland-M.Phil. in Statistics, Renmin University of China-B.A. in Statistics, Tongji University Working Papers Trust in DeFi: An empirical study of the decentralized exchange, with Shiyang Huang and Zhuo Zhong We empirically study the role of the decentralized cryptocurrency exchange (DEX) in affecting cryptocurrency trading. SSRN Link Digital footprints as collateral for debt collection, with Lili Dai, Jing Shi, and Bohui Zhang We examine the role of borrowers’ digital footprints in debt collection. SSRN Link Regulatory Punishment in an Oligopolistic Market: Evidence from Credit Rating Agencies, with Xiaolu Hu, Jing Shi, Clara Zhou, and Ao Shu Utilizing the Chinese bond market’s unique features, particularly a third-party rating agency, we investigate the regulatory suspension of Dagong Rating by Chinese regulators and its market impact. SSRN Link Inherited Culture and Corporate Innovation, with Xiaona Ji, and Zheyao Pan We use a cultural measure derived from folklore to study its economic outcomes. SSRN Link Publications A Good Sketch is Better than A Long Speech: Evaluate Delinquency Risk through Real-Time Video Analysis, with Xiangyu Chang, Lili Dai, Lingbing Feng, Jing Shi, and Bohui Zhang Review of Finance, 2025, 29(2), p.467-500 We propose an innovative method to assess borrowers’ creditworthiness in consumer credit markets by conducting machine-learning-based analyses on real-time video information that records borrowers’ behavior during the loan application process. Journal Link, SSRN Link, Code Share Local religiosity and financial advisor misconduct, with Arnold Cowan, Lei Gao, and Zheyao Pan Journal of Corporate Finance, 2024, 86, p.1-16 We find that local religious social norms mitigate professional misconduct by financial advisors. Journal Link Overlapping institutional ownership along the supply chain and earnings management of supplier firms, with Lei Gao, J.B.Kim, and Zheyao Pan Journal of Corporate Finance, 2024, 84, p.1-20 We explore the impact of overlapping institutional ownership (OIO) within supply chains on the earnings management practices of supplier firms. Journal Link, SSRN Link Individualistic CEO and corporate innovation: Evidence from U.S. frontier culture, with Lei Gao, Zheyao Pan, and Huixuan Zhang Research Policy, 2023, 52, 9, p.1-19 We study the relationship between a CEO’s individualistic cultural background and corporate innovation. Journal Link, SSRN Link Political connections and the transition to low-carbon energy sources in China: evidence from a quasi-natural experiment, with Jing Shi, Martina Linnenluecke, and Tom Smith Abacus, 2024,19. We extend existing research on political connections to test their role in facilitating or hindering the transition to low-carbon energy in China. Journal Link Federal judge ideology, securities class action litigation, and stock price crash risk, with Xiaoyu Cui, J.B.Kim, and Baolei Qi Accounting and Finance, 2024, 64, 4, p.4131-4155 We investigate whether and how federal judge ideology affects firm-specific stock price crash risk. Journal Link Arbitrage across different Bitcoin exchange venues: Perspectives from investor base and market related events, with Ao Shu, Feiyang Cheng, Zini Liang, and Zheyao Pan Accountingand Finance, 2023, 64, 5, p.5183-5210 We examine the impact of market related events and investor base on the spread of Bitcoin prices between two exchange platforms. Journal Link CEO power and labor-friendly policy, with Humyra Bristy, and Gary Tian Pacific-Basin Finance Journal, 2022, 71, p.1-17 This paper explores the effect of the presence of powerful CEOs on the quality of their workplace. Journal Link Culturally diverse board and corporate innovation, with Xiangxi Tang, Jing Shi, Ao Shu, and Fulong Xiaolu Accounting and Finance, 2021, 61, 4, p.5655-5679 We investigate the role of culturally diverse board of directors on firm outcomes in China. Journal Link Do outliers matter? The predictive ability of average skewness on market returns using robust skewness measures, with Xu Chong Bo, Yin Liao, Jing Shi, and Wu Yan Accounting and Finance, 2021, 61, 3, p.3977-4006 We used robust skewness measures to revisit a recent theory that the average asymmetry can negatively predict future market returns. Journal Link Property rights protection and mergers and acquisitions, with Tian Jin Fang, Jing He, and Jing Shi Pacific-Basin Finance Journal, 2021, 68, p.1-16 We exploit a property law enactment to study the impact of property rights protection on M&amp;As. Journal Link A general equilibrium approach to pricing volatility risk, with Martina Linnenluecke, Zhangxin Liu, Zheyao Pan, and Tom Smith PLoS ONE, 2019, 14, 4, p.1-18 This paper provides a general equilibrium approach to pricing volatility. Journal Link Divergence of opinion and long-run performance of private placements: evidence from the auction market, with Zheyao Pan, and Guangli Zhang Journal of Financial Research, 2019, 42, 2, p.271-302 We propose and construct a direct measure of investors’ divergence of opinion based on auction bids data from private placements in China. Journal Link How markets will drive the transition to a low carbon economy, with Martina Linnenluecke, Zheyao Pan, and Tom Smith Economic Modelling, 2019, 77, p.42-54 This paper investigates the driving factors behind the transition to a low carbon economy. Journal Link The wealth effects of the announcement of the Australian carbon pricing scheme, with Martina Linnenluecke, Zheyao Pan, and Tom Smith Pacific-Basin Finance Journal, 2019, 53, p.399-409 We examine the wealth effects associated with the announcement of the Australian Carbon Pricing Scheme. Journal Link Politically connected boards, value or cost: evidence from a natural experiment in China, with Guangli Zhang Accounting and Finance, 2018, 1, p.149-169 This study investigates the net effect of a politically connected board for a firm. Journal Link Twenty years of accounting and finance research on the Chinese capital market, with Jing He, Zheyao Pan, and Jing Shi Abacus, 2018, 54, 5, p.576-599 We review scholarly accounting and finance research pertaining to the Chinese capital market in Mainland China published in Tier 1 and Asia-Pacific regional journals during the 1999–2018 period. Journal Link On the relation between liquidity and the futures-cash basis: evidence from a natural experiment, with Zheyao Pan Journal of Financial markets, 2017, 36, p.115-131 As a response to the 2015 Chinese stock market crash, regulators prohibited arbitrage activities in the index futures and cash markets. We use this natural experiment to test the hypothesis that liquidity and pricing efficiency causally affect each other. Journal Link CEO inside debt and investment-cash flow sensitivity, with Zheyao Pan Accounting and Finance, 2016, 56, 2, p.423-443 We examine the effect of CEO pensions and deferred compensation (inside debt) on investment-cash flow sensitivity. Journal Link","link":"/2025/12/13/hello-world/"}],"tags":[],"categories":[]}